#Создать функцию, которая принимает список слов и печатает каждое слово с новой строки.
def list_of_words(words):
    for word in words:
        print(word)
list_of_words(['Pavel','Privet',64])