#Создать функцию, которая принимает строку и возвращает список слов в этой строке.
def list_of_strings(text):
    return text
print(list_of_strings('Pavel Privet 100 0.01'))