#Создать функцию, принимающую список чего либо и возвращающую множество, созданное из данных принятого списка.
def list_set(list_any):
    return set(list_any)
print(list_set(['jkjk', 'fdf', '323']))