# 1) Создай словарь c оценками для двух учеников (Анна, Игорь) с помощью функции dict и с помощью литерала. Ключом должно являться Имя ученика (строка), а значением оценка (число).
# 2) Возьми словарь из задания 1 и выведи оценку для Анны.
# 3) Возьми словарь из задания 1 и добавь туда запись для Петра.
# 4) Возьми словарь из задания 1 и удали оттуда запись для Игоря.

# 5) Даны следующие переменные
ip_addr = '192.168.20.43'
hostname = 'application-server-001'
# создай словарь с помощью функции dict и с помощью синтаксиса литерала, в котором значения будут взяты из этих переменных. Имена для ключей выбери сам (можно взять такие же как имена переменных).