# 1) Дана следущая функция
def connection_info(protocol, host, port):
    'введи сюда свой код'
# верни из функции словарь, в котором значения будут взяты из параметров функции

# 2) Дана следующая функция
def connection_string(protocol, host, port):
    return f'{protocol}://{host}:{port}'
# Напиши функцию show_connection которая принимает строку подключения и выводит её с помощью функции print

# 3) возьми функции connection_string и show_connection из задания 7 и соедини их вызовы вместе. Нужно чтобы значение возвращаемое функцией conenction_string передавалось в функцию show_connection.

# 4) Напиши функцию countdown, которая принимает число и выводит через print все числа от заданного до 0. Используй цикл while.

# 5) Напиши функцию words, которая принимает предложение (строку) и возвращает список слов в этом предложении.