"""
ЗАДАЧА: Управление расписанием

Дан словарь расписания: день -> список занятий (каждое занятие — словарь)
Нужно:
1. Вывести все занятия в понедельник
2. Найти день с максимальным количеством занятий
3. Посчитать общее количество часов занятий (каждое занятие 1.5 часа)
4. Вывести все занятия, которые начинаются в 10:30
"""

schedule = {
    "понедельник": [
        {"name": "Математика", "time": "09:00", "teacher": "Иванова"},
        {"name": "Физика", "time": "10:30", "teacher": "Петров"},
        {"name": "Информатика", "time": "12:00", "teacher": "Сидоров"},
    ],
    "вторник": [
        {"name": "Русский язык", "time": "09:00", "teacher": "Смирнова"},
        {"name": "Литература", "time": "10:30", "teacher": "Смирнова"},
    ],
    "среда": [
        {"name": "Математика", "time": "09:00", "teacher": "Иванова"},
        {"name": "Химия", "time": "10:30", "teacher": "Кузнецов"},
        {"name": "Биология", "time": "12:00", "teacher": "Кузнецов"},
        {"name": "Физкультура", "time": "13:30", "teacher": "Орлов"},
    ],
    "четверг": [
        {"name": "История", "time": "09:00", "teacher": "Васильев"},
        {"name": "Обществознание", "time": "10:30", "teacher": "Васильев"},
    ],
    "пятница": [
        {"name": "Английский язык", "time": "09:00", "teacher": "Новикова"},
        {"name": "Математика", "time": "10:30", "teacher": "Иванова"},
        {"name": "Физика", "time": "12:00", "teacher": "Петров"},
    ],
}
#используем list comprehesion, но можно и генератор(заменив на круглые скобки)
print(f'Уроки в понедельник: {", ".join([lesson["name"] for lesson in schedule["понедельник"]])}')

# max_lesson = 0
# max_day = None
# for day in schedule:
#     if len(schedule[day]) > max_lesson:
#         max_lesson = len(schedule[day])
#         max_day = day
# print(f'День с максимальным числом уроков: {max_day}')

max_day = max(schedule.items(),key=lambda x: len(x[1]))
print(max_day[0])

#Посчитать общее количество часов занятий (каждое занятие 1.5 часа)

print(f'Общее количество часов занятий : {sum([len(lessons) for lessons in schedule.values()])* 1.5}')

# Вывести все занятия, которые начинаются в 10:30

for day, lessons in schedule.items():
    for lesson in lessons:
        if lesson["time"] == "10:30":
            print(f'Занятие {lesson["name"]} начинается в 10-30 в/во {day}')


