"""
Дан список оценок. Сгруппируй их по диапазонам:
- Отлично (>= 90)
- Хорошо (>= 70 и < 90)
- Удовлетворительно (>= 50 и < 70)
- Плохо (< 50)
"""

grades = [95, 82, 67, 43, 91, 78, 55, 89, 73, 38, 60, 97, 84, 72, 59]

result = { 
    "Отлично (>= 90)": [],
    "Хорошо (>= 70 и < 90)": [],
    "Удовлетворительно (>= 50 и < 70)": [],
    "Плохо (< 50)": []
}

for i in grades:
    if i >=90:
        result['Отлично (>= 90)'].append(i)
    elif i >= 70 and i < 90:
        result['Хорошо (>= 70 и < 90)'].append(i)
    elif 50 <= i < 70:
        result['Удовлетворительно (>= 50 и < 70)'].append(i)
    else:
        result['Плохо (< 50)'].append(i)
print(result)
        
