# 1) Сравнение list и set
#     Создать стороковую переменную string = 'AAAABBBBCCCC'
#     Создать переменную l = list(string)
#     Создать переменную s = set(string)
#     Вывести переменные l и s в консоль с помощью функции print
#     Объяснить наблюдаемый вывод

string = 'AAAABBBBCCCC'
l = list(string)
s = set(string)
print(l,s)

множества отбрасывают любые повторяющиеся значения

