# 3) Позиционные аргументы
#     Создать функцию add сложения трёх чисел.
#     Вызвать функцию add с позиционным способом передачи аргументов (смотри 003/lesson.py).

def add(a,b,c):
    return a + b + c
print(add(5,5,5))