# 5) Проверка ключей в словаре
#     Создать функцию, которая проверяет, что заданный ключ присутствует в словаре. Функция должна принимать два параметра, 1 - словарь, в котором искать, 2 - ключ, который нужно проверить. Функция должна возвращать True или False, в зависимости от того, присутствует ли искомый ключ в переданном словаре. (смотри 004/blitz.py)
def check(my_dict,key):
    for key in dict:
        print(True)
check(my_dict{code=200, status='OK'},200)